In [1]:
import pandas as pd
from matplotlib import pyplot as plt

In [73]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
df = df[['Survived','Pclass','Sex','Age','Fare']]
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [75]:
df[df.columns[df.isna().any()]]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [76]:
df.isnull().any()

Survived    False
Pclass      False
Sex         False
Age          True
Fare        False
dtype: bool

In [77]:
df.Age = df.Age.fillna(df.Age.median())

In [78]:
y = df.Survived
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [79]:
from sklearn.preprocessing import LabelEncoder
le =  LabelEncoder()
df.Sex = le.fit_transform(df.Sex)

In [80]:
df

     Survived  Pclass  Sex   Age     Fare
0           0       3    1  22.0   7.2500
1           1       1    0  38.0  71.2833
2           1       3    0  26.0   7.9250
3           1       1    0  35.0  53.1000
4           0       3    1  35.0   8.0500
..        ...     ...  ...   ...      ...
886         0       2    1  27.0  13.0000
887         1       1    0  19.0  30.0000
888         0       3    0  28.0  23.4500
889         1       1    1  26.0  30.0000
890         0       3    1  32.0   7.7500

[891 rows x 5 columns]

In [81]:
X = df.drop('Survived',axis =1)
X

     Pclass  Sex   Age     Fare
0         3    1  22.0   7.2500
1         1    0  38.0  71.2833
2         3    0  26.0   7.9250
3         1    0  35.0  53.1000
4         3    1  35.0   8.0500
..      ...  ...   ...      ...
886       2    1  27.0  13.0000
887       1    0  19.0  30.0000
888       3    0  28.0  23.4500
889       1    1  26.0  30.0000
890       3    1  32.0   7.7500

[891 rows x 4 columns]

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2)

In [50]:
from sklearn import tree
model = tree.DecisionTreeClassifier()
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [51]:
model.score(X_test,y_test)

0.7821229050279329

In [52]:
y_pred = model.predict(X_test)

In [53]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test,y_pred)
cm

array([[93, 12],
       [27, 47]], dtype=int64)

# Another try

In [56]:
from sklearn.linear_model import LogisticRegression
reg = LogisticRegression()
reg.fit(X_train,y_train)

LogisticRegression()

In [57]:
reg.score(X_test,y_test)

0.7821229050279329

In [82]:
dummy = pd.get_dummies(df.Sex,prefix = 'Gender')

In [83]:
df = pd.concat([df,dummy], axis = 1)

In [84]:
X = df.drop('Sex', axis = 1)
X

     Survived  Pclass   Age     Fare  Gender_0  Gender_1
0           0       3  22.0   7.2500         0         1
1           1       1  38.0  71.2833         1         0
2           1       3  26.0   7.9250         1         0
3           1       1  35.0  53.1000         1         0
4           0       3  35.0   8.0500         0         1
..        ...     ...   ...      ...       ...       ...
886         0       2  27.0  13.0000         0         1
887         1       1  19.0  30.0000         1         0
888         0       3  28.0  23.4500         1         0
889         1       1  26.0  30.0000         0         1
890         0       3  32.0   7.7500         0         1

[891 rows x 6 columns]

In [85]:
X = X.drop('Gender_1', axis =1)
X

     Survived  Pclass   Age     Fare  Gender_0
0           0       3  22.0   7.2500         0
1           1       1  38.0  71.2833         1
2           1       3  26.0   7.9250         1
3           1       1  35.0  53.1000         1
4           0       3  35.0   8.0500         0
..        ...     ...   ...      ...       ...
886         0       2  27.0  13.0000         0
887         1       1  19.0  30.0000         1
888         0       3  28.0  23.4500         1
889         1       1  26.0  30.0000         0
890         0       3  32.0   7.7500         0

[891 rows x 5 columns]

In [86]:
X_train, X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2)

In [87]:
reg_log = LogisticRegression()
reg_log.fit(X_train,y_train)

LogisticRegression()

In [88]:
reg_log.score(X_test,y_test)

1.0

In [89]:
mo_tree = tree.DecisionTreeClassifier()
mo_tree.fit(X_train,y_train)

DecisionTreeClassifier()

In [90]:
mo_tree.score(X_test,y_test)

1.0